<a href="https://colab.research.google.com/github/purum01/crawling_ref/blob/master/exam02_excel.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Life is too short, You need python!

공공데이터 - https://www.data.go.kr/dataset/3035522/fileData.do

## pandas 사용하기

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_excel('/content/drive/MyDrive/apt.xlsx')

In [ ]:
df

     지역명               규모구분    연도   월 분양가격(㎡)
0     서울                 전체  2015  10    5841
1     서울         전용면적 60㎡이하  2015  10    5652
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4     서울        전용면적 102㎡초과  2015  10    5879
...   ..                ...   ...  ..     ...
4334  경남   전용면적 60㎡초과 85㎡이하  2020   4    3159
4335  경남  전용면적 85㎡초과 102㎡이하  2020   4    3246
4336  제주                 전체  2020   4    4085
4337  제주         전용면적 60㎡이하  2020   4    4039
4338  제주   전용면적 60㎡초과 85㎡이하  2020   4    4091

[4339 rows x 5 columns]

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
df.head()

  지역명               규모구분    연도   월 분양가격(㎡)
0  서울                 전체  2015  10    5841
1  서울         전용면적 60㎡이하  2015  10    5652
2  서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3  서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4  서울        전용면적 102㎡초과  2015  10    5879

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4339 entries, 0 to 4338
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4339 non-null   object
 1   규모구분     4339 non-null   object
 2   연도       4339 non-null   int64
 3   월        4339 non-null   int64
 4   분양가격(㎡)  4339 non-null   object
dtypes: int64(2), object(3)
memory usage: 169.6+ KB

## 2019년 자료만 추출하여 새로운 파일에 저장하기

In [ ]:
df_2019 = df[df['연도']==2019]
df_2019.reset_index(drop=True, inplace=True)

In [ ]:
df_2019.head()

  지역명               규모구분    연도  월 분양가격(㎡)
0  서울                 전체  2019  1    7600
1  서울         전용면적 60㎡이하  2019  1    7400
2  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
4  서울        전용면적 102㎡초과  2019  1    7787

In [ ]:
df_2019.to_excel('apt_2019.xlsx')

In [ ]:
df_2019_seoul = df_2019[df_2019['지역명']=='서울']
df_2019_busan = df_2019[df_2019['지역명']=='부산']

df_2019_seoul.reset_index(drop=True, inplace=True)
df_2019_busan.reset_index(drop=True, inplace=True)

In [ ]:
df_2019_seoul.head()

  지역명               규모구분    연도  월 분양가격(㎡)
0  서울                 전체  2019  1    7600
1  서울         전용면적 60㎡이하  2019  1    7400
2  서울   전용면적 60㎡초과 85㎡이하  2019  1    8105
3  서울  전용면적 85㎡초과 102㎡이하  2019  1    6842
4  서울        전용면적 102㎡초과  2019  1    7787

In [ ]:
df_2019_busan.head()

  지역명               규모구분    연도  월 분양가격(㎡)
0  부산                 전체  2019  1    4068
1  부산         전용면적 60㎡이하  2019  1    3778
2  부산   전용면적 60㎡초과 85㎡이하  2019  1    4064
3  부산  전용면적 85㎡초과 102㎡이하  2019  1    4066
4  부산        전용면적 102㎡초과  2019  1    4293

In [ ]:
df_2019_seoul.to_excel('apt_2019_seoul.xlsx')
df_2019_busan.to_excel('apt_2019_busan.xlsx')

## 5의 배수에 해당하는 행의 데이타만 추출하기

In [ ]:
df_2019_seoul[::5]

   지역명 규모구분    연도   월 분양가격(㎡)
0   서울   전체  2019   1    7600
5   서울   전체  2019   2    7627
10  서울   전체  2019   3    7772
15  서울   전체  2019   4    7784
20  서울   전체  2019   5    7786
25  서울   전체  2019   6    8100
30  서울   전체  2019   7    8067
35  서울   전체  2019   8    8093
40  서울   전체  2019   9    8085
45  서울   전체  2019  10    8091
50  서울   전체  2019  11    8062
55  서울   전체  2019  12    7955

데이타 병합하기

In [ ]:
seoul = pd.read_excel('apt_2019_seoul.xlsx')
busan = pd.read_excel('apt_2019_busan.xlsx')

In [ ]:
seoul_전체 = seoul[::5]

In [ ]:
busan_전체 = busan[::5]

In [ ]:
seoul_busan_전체 = pd.DataFrame()
seoul_busan_전체['월'] = seoul_전체['월']
seoul_busan_전체['서울'] = seoul_전체['분양가격(㎡)']
seoul_busan_전체['부산'] = busan_전체['분양가격(㎡)']

In [ ]:
seoul_busan_전체

     월    서울    부산
0    1  7600  4068
5    2  7627  4068
10   3  7772  4068
15   4  7784  3927
20   5  7786  3924
25   6  8100  3906
30   7  8067  3872
35   8  8093  3931
40   9  8085  4023
45  10  8091  4040
50  11  8062  3985
55  12  7955  3884

In [ ]:
seoul_busan_전체.to_excel('seoul_busan_전체.xlsx', index=False)

## Excel 파일 수정 작업하기

https://openpyxl.readthedocs.io/en/stable/index.html

In [ ]:
import openpyxl

In [ ]:
filename = 'seoul_busan_전체.xlsx'
wb = openpyxl.load_workbook(filename)
sheet = wb['Sheet1']

In [ ]:
seoul_sum = max([ cell[0].value for cell in sheet['B2':'B13']])
busan_sum = max([ cell[0].value for cell in sheet['C2':'C13']])

In [ ]:
seoul_sum

8100

In [ ]:
busan_sum

4068

In [ ]:
sheet['A14'].value = '최고가' 
sheet['B14'].value = seoul_sum
sheet['C14'].value = busan_sum

## 스타일 지정하기

In [ ]:
from openpyxl.styles import Font, Alignment
from openpyxl.styles import Border, Side, Color, PatternFill

In [ ]:
font_15 = Font(name='맑은 고딕', size=15, bold=True)

In [ ]:
align_center = Alignment(horizontal='center', vertical='center')
align_vcenter = Alignment(vertical='center')

In [ ]:
border_thin = Border(left=Side(style='thin'), right=Side(style='thin'),top=Side(style='thin'),bottom=Side(style='thin'))

In [ ]:
fill_orange = PatternFill(patternType='solid', fgColor=Color('FFC000'))
fill_lightgrey = PatternFill(patternType='solid', fgColor=Color('D3D3D3'))

In [ ]:
cell_max = sheet['A14']

In [ ]:
cell_max.font = font_15
cell_max.alignment = align_center
cell_max.border = border_thin 
cell_max.fill = fill_orange

In [ ]:
for row in sheet['A2:C14']:
    for cell in row:
        cell.border = border_thin
        cell.number_format = '#,##0'
for row in sheet['B14:C14']:
    for cell in row:
        cell.alignment = align_vcenter
        cell.fill = fill_orange

In [ ]:
wb.save(filename)

## 차트 작성하기

In [ ]:
from openpyxl.chart import Reference, Series, BarChart

In [ ]:
chart = BarChart()
chart.title = '2019년 월별 분양가'

In [ ]:
vals = Reference(sheet, range_string='Sheet1!B2:B13')
series = Series(vals, title='서울')
chart.append(series)

In [ ]:
vals = Reference(sheet, range_string='Sheet1!C2:C13')
series = Series(vals, title='부산')
chart.append(series)

In [ ]:
sheet.add_chart(chart, 'E1')

In [ ]:
wb.save(filename)